# IsNetworkBasedCalculationsEnabled Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..IsNetworkBasedCalculationsEnabled Method
DuctSettings Class See Also
---
Indicates whether network based calculations for duct networks is enabled in the specified document.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsNetworkBasedCalculationsEnabled(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function IsNetworkBasedCalculationsEnabled ( _
	document As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsNetworkBasedCalculationsEnabled(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
Returns true if network based calculations for duct networks is enabled, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace